package com.spartaonline.learn.jpa;

/**
 * Created by vladimir on 22.11.15.
 */
public class RandomNameGenerator {

    private static final String[] ADJECTIVES = {
            "Большой", "Красный", "Синий", "Зеленый", "Бежевый", "Бирюзовый", "Белый",
            "Безумный", "Разумный", "Клёвый", "Маленький", "Малюсенький", "Парадный", "Книжный", "Бурый",
            "Разговорчивый", "Молчаливый", "Амбициозный", "Лаковый", "Раздражительный", "Механический",
            "Органический", "Золотой", "Серебрянный", "Противный", "Приятный", "Зажигательный", "Веселый",
            "Печальный", "Оптимистичный", "Занудный", "Морской", "Пушистый"
    };
    String[] SUBJECTS = {
            "крейсер", "маузер", "лемур", "вибратор", "воин", "рыцарь", "дракон", "одеколон",
            "принтер", "компьютер", "фотик", "автомобиль", "замок", "iPad", "iPod", "стол", "стул", "корпус",
            "радиатор", "насос", "монитор", "балкон", "кирпич", "диван", "телевизор", "рентген", "умывальник",
            "педик", "орк", "хоббит", "раб", "качок", "Дэнчик", "крот", "тигр", "крокодил", "бегемотик"
    };

    public String createName() {
        int adjectiveIndex = (int) (Math.random() * ADJECTIVES.length);
        int subjectIndex = (int) (Math.random() * SUBJECTS.length);
        return ADJECTIVES[adjectiveIndex] + " " + SUBJECTS[subjectIndex];
    }

}
